netsuite/netsuite-connector/netsuite-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/netsuite/api_getSelectValue_negative.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:urn="urn:messages_2014_1.platform.webservices.netsuite.com"
                  xmlns:urn1="urn:core_2014_1.platform.webservices.netsuite.com">
    <soapenv:Header>
        <urn:preferences>
            <urn:warningAsError>true</urn:warningAsError>
            <urn:disableMandatoryCustomFieldValidation>false</urn:disableMandatoryCustomFieldValidation>
            <urn:disableSystemNotesForCustomFields>true</urn:disableSystemNotesForCustomFields>
            <urn:ignoreReadOnlyFields>true</urn:ignoreReadOnlyFields>
        </urn:preferences>
        <urn:partnerInfo>
            <urn:partnerId></urn:partnerId>
        </urn:partnerInfo>
        <urn:applicationInfo>
            <urn:applicationId></urn:applicationId>
        </urn:applicationInfo>
        <urn:passport>
            <urn1:email>%s(email)</urn1:email>
            <urn1:password>%s(password)</urn1:password>
            <urn1:account>%s(account)</urn1:account>
            <urn1:role>
                <urn1:name></urn1:name>
            </urn1:role>
        </urn:passport>
    </soapenv:Header>
    <soapenv:Body>
        <urn:getSelectValue>
            <fieldDescription xmlns:platformCore="urn:core_2014_1.platform.webservices.netsuite.com">
                <platformCore:recordType>Invalid</platformCore:recordType>
                <platformCore:sublist>itemList</platformCore:sublist>
                <platformCore:field>item</platformCore:field>
                <platformCore:filterByValueList>
                    <platformCore:filterBy>
                        <platformCore:field>entity</platformCore:field>
                        <platformCore:internalId>%s(getSelectValueFilterByInternalId)</platformCore:internalId>
                    </platformCore:filterBy>
                </platformCore:filterByValueList>
            </fieldDescription>
            <pageIndex>1</pageIndex>
        </urn:getSelectValue>
    </soapenv:Body>
</soapenv:Envelope>